quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_PWM_201910813.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/



#include "STM32_PWM.H"
#include "STM32_GPIO.H"


/*##############################################################################
################################################################################
# 模块名		:	STM32_PWM	
# 功能描述	:	PWM配置使用
-------------------------------------------------------------------------------	
***********************************************************************************************************
---------------------------------------------------------------------------------------	
外设	|	CH1		|	CH2		|	CH3		|	CH4		|								|								|								|
---------------------------------------------------------------------------------------	
TIM1	|	PA8		|	PA9		|	PA10	|	PA11	|								|								|								|
---------------------------------------------------------------------------------------	
TIM2	|	PA0		|	PA1		|	PA2		|	PA3		|								|								|								|
---------------------------------------------------------------------------------------	
TIM3	|	PA6		|	PA7		|	PB0		|	PB1		|								|								|								|
---------------------------------------------------------------------------------------	
TIM4	|	PB6		|	PB7		|	PB8		|	PB9		|								|								|								|
---------------------------------------------------------------------------------------	
TIM5	|				|				|				|				|								|								|								|
---------------------------------------------------------------------------------------	
TIM6	|				|				|				|				|								|								|								|
---------------------------------------------------------------------------------------	
TIM7	|				|				|				|				|								|								|								|
---------------------------------------------------------------------------------------	
TIM8	|				|				|				|				|								|								|								|
---------------------------------------------------------------------------------------	


################################################################################
###############################################################################*/

u32 Tim1_Count	=	0;
u32 Tim2_Count	=	0;
u32 Tim3_Count	=	0;
u32 Tim4_Count	=	0;

void PWM_ClockCmd(TIM_TypeDef* TIMx,u16 Prescaler,u16 Period,u8 PWM_RATIO);		//开启相关GPIO时钟	
void PWM_GPIO_Configuration(void);			//PWM使用的GPIO配置
void PWM_SET(TIM_TypeDef* TIMx,u8 PWM_RATIO);	//PWM设定
/*******************************************************************************
* 函数名		:	PWM_OUT	
* 功能描述	:		 
* 输入		:	PWM_Frequency 频率，单位Hz	
* 输出		:
* 返回 		:
*******************************************************************************/
void PWM_OUT			//PWM输出配置
(
	TIM_TypeDef* TIMx,											//所使用的定时器
	PWM_OUTChannelTypeDef PWM_OUTChanneln,	//PWM输出通道号
	double PWM_Frequency,										//输出频率，最小频率0.02Hz		
	u16 PWM_Ratio														//输出占空比，分辨率1/1000
)
{
	//*1,结构体定义
	//*2,变量定义
	//*3,管脚确认
	//*4,打开相应的时钟
	//*5,管脚配置（初始化）
	//*6,定时器配置（初始化）
	//*7,PWM输出配置（初始化）
	//*8,占空比配置	
	
	//*1,结构体定义***********************************************************************
	GPIO_InitTypeDef 				GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef	TIM_TimeBaseStructure;	//定时器结构体定义
	TIM_OCInitTypeDef 			TIMOCInitStructure;
	RCC_ClocksTypeDef 			RCC_ClocksStatus;							//时钟状态---时钟值	
	//*2,变量定义*************************************************************************	
	GPIO_TypeDef* GPIOx				=	0;			//x=A/B/C/D/E/F/G
	u16 GPIO_Pin_n						=	0xFF;		//n=0~15;
	u32 RCC_APB2Periph_GPIOx	=	0x00;		//x=A/B/C/D/E/F/G	
	u32	TIMx_Frequency=0;								//	定时器时钟
	u16 TIMx_Prescaler				=	0	;			//	定时器时钟分频值		取值范围：0x0000~0xFFFF
  u16 TIMx_Period						=	0	;			//	定时器自动重装载值	取值范围：0x0000~0xFFFF
//	u32	Microsecond						=	0	;		//	微秒
//	u32	Nanosecond						=	0	;		//	纳秒
	double	Tim_num1					=	0	;			//	临时变量1
//	u8	Tim_flg								=	0	;			//	临时变量2
	//*3,管脚配置--根据输入参数选择相应的GPIO************************************************
	switch (*(u32*)&TIMx)
	{
		case TIM1_BASE:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_8;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;	
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_9;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_10;	RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_11;	RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
			}
			break;
		
		case TIM2_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_0;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_1;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_2;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_3;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
			}
			break;
		
		case TIM3_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_6;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_7;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_0;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_1;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
			}
			break;
		
