quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_PWM_201910813.C
	TIMOCInitStructure.TIM_OCMode 			= TIM_OCMode_PWM1; 								//选择定时器模式:TIM脉冲宽度调制模式1
	TIMOCInitStructure.TIM_OutputState 	= TIM_OutputState_Disable;      	//禁止输出比较状态
	TIMOCInitStructure.TIM_OutputNState	=	TIM_OutputNState_Enable; 				//使能  互补 输出状态
	TIMOCInitStructure.TIM_Pulse 				=(u16)PWM_Ratio;									//占空比=(CCRx/ARR)*1000%
	TIMOCInitStructure.TIM_OCPolarity 	= TIM_OCPolarity_High;						//输出极性:TIM输出比较极性高
	TIMOCInitStructure.TIM_OutputState 	= TIM_OutputState_Enable;					//比较输出使能
	//10）定时器配置（初始化*******************************************************************
	switch(PWM_OUTChanneln)
	{
		case PWM_OUTChannel1:	TIM_OC1Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel2:	TIM_OC2Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel3:	TIM_OC3Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel4:	TIM_OC4Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		default:
		break;
	}	
	TIM_CtrlPWMOutputs(TIMx,ENABLE);																//设置TIM2的PWM输出使能
	//11）定时器配置（初始化*******************************************************************
	switch(PWM_OUTChanneln)			//使能TIM在CCR上的预装载寄存器
	{
		case PWM_OUTChannel1:	TIM_OC1PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel2:	TIM_OC2PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel3:	TIM_OC3PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel4:	TIM_OC4PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
	}	
	
	TIM_ARRPreloadConfig(TIMx, ENABLE);			//ARPE使能 
	
	TIM_Cmd(TIMx, ENABLE); 									//使能TIM
}
//------------------------------------------------------------------------------
/*******************************************************************************
* 函数名		:	PWM_OUT	
* 功能描述	:		 
* 输入		:	PWM_Frequency 频率，单位Hz	
* 输出		:
* 返回 		:
*******************************************************************************/
void PWM_OUTRemap			//PWM输出配置
(
	TIM_TypeDef* TIMx,											//所使用的定时器
	PWM_OUTChannelTypeDef PWM_OUTChanneln,	//PWM输出通道号
	double PWM_Frequency,										//输出频率，最小频率0.02Hz		
	u16 PWM_Ratio														//输出占空比，分辨率1/1000
)
{
	//*1,结构体定义
	//*2,变量定义
	//*3,管脚确认
	//*4,打开相应的时钟
	//*5,管脚配置（初始化）
	//*6,定时器配置（初始化）
	//*7,PWM输出配置（初始化）
	//*8,占空比配置	
	
	//*1,结构体定义***********************************************************************
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef	TIM_TimeBaseStructure;	//定时器结构体定义
	TIM_OCInitTypeDef TIMOCInitStructure;
	RCC_ClocksTypeDef RCC_ClocksStatus;							//时钟状态---时钟值	
	//*2,变量定义*************************************************************************	
	GPIO_TypeDef* GPIOx				=	0;			//x=A/B/C/D/E/F/G
	u16 GPIO_Pin_n						=	0xFF;		//n=0~15;
	u32 RCC_APB2Periph_GPIOx	=	0x00;		//x=A/B/C/D/E/F/G	
	u32	TIMx_Frequency=0;								//	定时器时钟
	u16 TIMx_Prescaler				=	0	;			//	定时器时钟分频值		取值范围：0x0000~0xFFFF
  u16 TIMx_Period						=	0	;			//	定时器自动重装载值	取值范围：0x0000~0xFFFF
//	u32	Microsecond						=	0	;		//	微秒
//	u32	Nanosecond						=	0	;		//	纳秒
	double	Tim_num1					=	0	;			//	临时变量1
//	u8	Tim_flg								=	0	;			//	临时变量2
	//*3,管脚配置--根据输入参数选择相应的GPIO************************************************
	switch (*(u32*)&TIMx)
	{
		case TIM1_BASE:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_8;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;	
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_9;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_10;	RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_11;	RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
			}
			break;
		
		case TIM2_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_0;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_3;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_2;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_3;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
			}
			break;
		
		case TIM3_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_6;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOA;	GPIO_Pin_n	=	GPIO_Pin_7;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOA;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_0;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_1;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
			}
			break;
		
		case TIM4_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_6;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_7;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_8;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_9;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
			}
			break;
		
		case TIM5_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
			break;
		
		case TIM6_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
			break;
		
		case TIM7_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
			break;
		
