quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_PWM_201910813.C
		case TIM4_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
			switch(PWM_OUTChanneln)
			{
				case PWM_OUTChannel1:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_6;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel2:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_7;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel3:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_8;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
				case PWM_OUTChannel4:	GPIOx	=	GPIOB;	GPIO_Pin_n	=	GPIO_Pin_9;		RCC_APB2Periph_GPIOx	=	RCC_APB2Periph_GPIOB;
															break;
			}
			break;
		
		case TIM5_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
			break;
		
		case TIM6_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
			break;
		
		case TIM7_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
			break;
		
		case TIM8_BASE:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);
			break;
		
		default:
			break;		
	}
	
	
	//*4,打开相应的时钟*********************************************************************
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);	//使能复用时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOx, ENABLE);	//使能引脚时钟	
	//*5,管脚配置（初始化）*****************************************************************
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_n;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP ;//复用推挽输出
	GPIO_Init(GPIOx,&GPIO_InitStructure);	
	//*6,获取TIMx时钟**********************************************************************
	//1）-----分频值及自动重装载值计算（PWM_Frequency 频率，单位Hz）
	//--------1MHz 1us=1000ns,1KHz 10us=10000ns
	RCC_GetClocksFreq(&RCC_ClocksStatus);	//获取时钟参数
	TIMx_Frequency = RCC_ClocksStatus.SYSCLK_Frequency;;
	if (((*(u32*)&TIMx)&APB2PERIPH_BASE) == APB2PERIPH_BASE)
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK2_Frequency;	//APB2
  }
  else
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK1_Frequency;	//APB1
  }
	//*7,计算定时器参数*********************************************************************
	//Fsys==Fpwm*Count==Fpwm*(Prescaler*Period)	
	//	TIMx_Prescaler				=	72-1		;		// 	定时器时钟分频值
	//	TIMx_Period						=	1000-1	;		// 	定时器自动重装载值
	//	Tim_num1							=	0				;		//	临时变量1
	if(1/PWM_Frequency>10)
	{
		Tim_num1=(double)(TIMx_Frequency)/(PWM_Frequency*100);							//根据定时器输出频率计算计数值
		TIMx_Prescaler=60000;
		TIMx_Period=(u16)(((double)Tim_num1/(double)TIMx_Prescaler)*200);
	}
	else if(1/PWM_Frequency>1.0)
	{
		Tim_num1=(double)(TIMx_Frequency)/(PWM_Frequency*10);							//根据定时器输出频率计算计数值
		TIMx_Prescaler=60000;
		TIMx_Period=(u16)(((double)Tim_num1/(double)TIMx_Prescaler)*20);
	}
	else if(PWM_Frequency>=1.0)
	{
		Tim_num1=(double)(TIMx_Frequency)/(PWM_Frequency);							//根据定时器输出频率计算计数值
		Tim_num1=(double)(Tim_num1*2.0);
		if(Tim_num1>=10000000)
		{
			TIMx_Prescaler=2000;
			TIMx_Period=Tim_num1/TIMx_Prescaler;
		}
		else if(Tim_num1>=1000000)
		{
			TIMx_Prescaler=200;
			TIMx_Period=Tim_num1/TIMx_Prescaler;
		}
		else if(Tim_num1>=100000)
		{
			TIMx_Prescaler=20;
			TIMx_Period=Tim_num1/TIMx_Prescaler;
		}
		else if(Tim_num1>=65530)
		{
			TIMx_Prescaler=2;
			TIMx_Period=Tim_num1/TIMx_Prescaler;
		}
		else
		{
			TIMx_Prescaler=1;
			TIMx_Period=Tim_num1/TIMx_Prescaler;
		}
	}	
	//8)**********定时器初始化
	TIM_TimeBaseStructure.TIM_Prescaler = TIMx_Prescaler-1; 				//设定分频值
	TIM_TimeBaseStructure.TIM_Period 		= TIMx_Period-1;        		//设定自动重装载值
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;  				//不分割
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  		//向上计数
	TIM_TimeBaseInit(TIMx, &TIM_TimeBaseStructure);		//初始化	
	//9）定时器配置（初始化*******************************************************************
	if((TIMx_Period*(u32)PWM_Ratio)>1200)
		PWM_Ratio=(u16)((u32)(TIMx_Period*PWM_Ratio)/1200);
	else if(PWM_Ratio!=0)
		PWM_Ratio=1;
		
	TIMOCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; 								//选择定时器模式:TIM脉冲宽度调制模式1
	TIMOCInitStructure.TIM_Pulse =(u16)PWM_Ratio;										//占空比=(CCRx/ARR)*1000%
	TIMOCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;				//输出极性:TIM输出比较极性高
	TIMOCInitStructure.TIM_OutputState = TIM_OutputState_Enable;		//比较输出使能
	//10）定时器配置（初始化*******************************************************************
	switch(PWM_OUTChanneln)
	{
		case PWM_OUTChannel1:	TIM_OC1Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel2:	TIM_OC2Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel3:	TIM_OC3Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		case PWM_OUTChannel4:	TIM_OC4Init(TIMx, &TIMOCInitStructure);												//TIM2的CH1输出使能
		break;
		default:
		break;
	}	
	TIM_CtrlPWMOutputs(TIMx,ENABLE);																//设置TIM2的PWM输出使能
	//11）定时器配置（初始化*******************************************************************
	switch(PWM_OUTChanneln)			//使能TIM在CCR上的预装载寄存器
	{
		case PWM_OUTChannel1:	TIM_OC1PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel2:	TIM_OC2PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel3:	TIM_OC3PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
		case PWM_OUTChannel4:	TIM_OC4PreloadConfig(TIMx, TIM_OCPreload_Enable);
				break;
	}	
	
	TIM_ARRPreloadConfig(TIMx, ENABLE);			//ARPE使能 
	
	TIM_Cmd(TIMx, ENABLE); 									//使能TIM
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SetPWM_Ratio(u16 PWM_Ratio)
{
//	TIM_OCInitTypeDef TIMOCInitStructure;
//	TIMOCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; 								//选择定时器模式:TIM脉冲宽度调制模式1
//	TIMOCInitStructure.TIM_Pulse =PWM_Ratio;												//占空比=(CCRx/ARR)*1000%
//	TIMOCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;				//输出极性:TIM输出比较极性高
//	TIMOCInitStructure.TIM_OutputState = TIM_OutputState_Enable;		//比较输出使能
//	
//	TIM_OC1Init(TIM2, &TIMOCInitStructure);													//TIM2的CH1输出使能
	
	TIM2->CCR1 = PWM_Ratio;
}

