quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_PWM_201910813.C
/*******************************************************************************
* 函数名		:	PWM_OUT	
* 功能描述	:		 
* 输入		:	PWM_Frequency 频率，单位Hz	
* 输出		:
* 返回 		:
*******************************************************************************/
void PWM_OUT_TIMConf(PWM_TimDef* PWM_Tim)			//PWM输出配置---最大100KHz
{
	//*1,结构体定义***********************************************************************
	TIM_TimeBaseInitTypeDef	TIM_TimeBaseStructure;	//定时器结构体定义	
	RCC_ClocksTypeDef RCC_ClocksStatus;							//时钟状态---时钟值
	NVIC_InitTypeDef	NVIC_InitStructure;						//中断结构体
	
	
	//*2,变量定义*************************************************************************	
	
//	GPIO_TypeDef* GPIOx		=	PWM_Tim->PWM_BasicData.GPIOx;			//x=A/B/C/D/E/F/G
	TIM_TypeDef * TIMx		=	PWM_Tim->PWM_BasicData.TIMx;
//	u16 GPIO_Pin_n				=	PWM_Tim->PWM_BasicData.GPIO_Pin_n;
	double PWM_Frequency	=	2*(PWM_Tim->PWM_BasicData.PWM_Frequency);
	
	u8 TIM_IRQChannel=0;

//	u32 RCC_APB2Periph_GPIOx	=	0x00;		//x=A/B/C/D/E/F/G	
	u32	TIMx_Frequency				=	0;			//	定时器时钟
	u16 TIMx_Prescaler				=	0	;			//	定时器时钟分频值		取值范围：0x0000~0xFFFF
  u16 TIMx_Period						=	0	;			//	定时器自动重装载值	取值范围：0x0000~0xFFFF
	
	//*3,参数设置**************************************************************************	
	
	//*5,GPIO配置============================================================================	
	//*5.1,打开相应的时钟*********************************************************************
	GPIO_Configuration_OPP50(PWM_Tim->PWM_BasicData.GPIOx,PWM_Tim->PWM_BasicData.GPIO_Pin_n);

	//*6,定时器配置============================================================================
	//*6.1,打开相应的时钟*********************************************************************
	switch ((u32)TIMx)
	{
		case TIM1_BASE:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
			TIM_IRQChannel=TIM1_UP_IRQChannel;	
			TIM_TimeBaseStructure.TIM_RepetitionCounter	=	0;
			break;
		
		case TIM2_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
			TIM_IRQChannel=TIM2_IRQChannel;
			break;
		
		case TIM3_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
			TIM_IRQChannel=TIM3_IRQChannel;
			break;
		
		case TIM4_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
			TIM_IRQChannel=TIM4_IRQChannel;
			break;
		
		case TIM5_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
			TIM_IRQChannel=TIM5_IRQChannel;
			break;
		
		case TIM6_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
			TIM_IRQChannel=TIM6_IRQChannel;
			break;
		
		case TIM7_BASE:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
			TIM_IRQChannel=TIM7_IRQChannel;
			break;
		
		case TIM8_BASE:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);
			TIM_IRQChannel=TIM8_UP_IRQChannel;
			TIM_TimeBaseStructure.TIM_RepetitionCounter	=	0;
			break;
		
		default:
			break;		
	}
	//*6.2,计算定时时间**********************************************************************
	//*6.2.1,计算最大公约数（减少中断次数）****************************************************
//	c	=	a	%	b;
//	while(c	!=	0)
//	{
//		a	=	b;
//		b	=	c;
//		c	=	a	%	b;	
//	}

	PWM_Tim->PWM_BasicData.PWM_Count	=	0;
	PWM_Tim->PWM_RunData.PWM_Cycle	=	0;
//	PWM_Tim->PWM_RunData.PWM_Pulse	=	0;

	//*6.2.2,计算实际运行频率******************************************************************
//	PWM_Frequency	=	(double)(PWM_Frequency	*	PWM_Tim->PWM_RunData.PWM_Cycle);
	
	//*6.2.3,获取TIMx时钟**********************************************************************
	//1）-----分频值及自动重装载值计算（PWM_Frequency 频率，单位Hz）
	//--------1MHz 1us=1000ns,1KHz 10us=10000ns
	RCC_GetClocksFreq(&RCC_ClocksStatus);	//获取时钟参数
	TIMx_Frequency = RCC_ClocksStatus.SYSCLK_Frequency;
	if ((((u32)TIMx)&APB2PERIPH_BASE) == APB2PERIPH_BASE)
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK2_Frequency;	//APB2
  }
  else
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK1_Frequency;	//APB1
  }
//	TIMx_Frequency = 72000000;
	//*6.2.4,计算定时器参数*********************************************************************
	//Fsys==Fpwm*Count==Fpwm*(Prescaler*Period)	
	//	TIMx_Prescaler				=	72-1		;		// 	定时器时钟分频值
	//	TIMx_Period						=	1000-1	;		// 	定时器自动重装载值
	//	Tim_num1							=	0				;		//	临时变量1
	if(PWM_Frequency>100000)		//>100KHz
	{
		TIMx_Prescaler=0;
		TIMx_Period=(u16)(TIMx_Frequency/PWM_Frequency-1);
	}
	else if(PWM_Frequency>1000)	//>1KHz
	{
		TIMx_Prescaler=10-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/10-1);
	}
	else if(PWM_Frequency>100)		//>100Hz
	{
		TIMx_Prescaler=100-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/100-1);
	}
	else if(PWM_Frequency>10)		//>10Hz
	{
		TIMx_Prescaler=1000-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/1000-1);
	}
	else if(PWM_Frequency<=10)		//<=10Hz
	{
		TIMx_Prescaler=2000-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/2000-1);
	}	
	//6.3定时器初始化*********************************************************************
	TIM_TimeBaseStructure.TIM_Prescaler = TIMx_Prescaler; 				//设定分频值
	TIM_TimeBaseStructure.TIM_Period 		= TIMx_Period;        		//设定自动重装载值
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;  				//不分割
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  		//向上计数
	TIM_TimeBaseInit(TIMx, &TIM_TimeBaseStructure);		//初始化	
		
	//*6,中断配置============================================================================
	NVIC_InitStructure.NVIC_IRQChannel = TIM_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	/* Clear TIMx update pending flag[清除TIMx溢出中断] */
	TIM_ClearFlag(TIMx, TIM_FLAG_Update);

	/* Enable TIM2 Update interrupt [TIMx溢出中断允许]*/
	TIM_ITConfig(TIMx, TIM_IT_Update, ENABLE); 
	
	TIM_Cmd(TIMx, DISABLE); 									//使能TIM
}
/*******************************************************************************
* 函数名		:	PWM_OUT	
* 功能描述	:		 
* 输入		:	PWM_Frequency频率，单位Hz	
* 输出		:
* 返回 		:
*******************************************************************************/
void PWM_OUT_SetFre(PWM_TimDef* PWM_Tim,double PWM_Frequency)			//PWM输出频率最大10MHz计算
{

	//*1,结构体定义***********************************************************************
	RCC_ClocksTypeDef RCC_ClocksStatus;							//时钟状态---时钟值	
	
