quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_PWM_201910813.C
	//*2,变量定义*************************************************************************		

	TIM_TypeDef * TIMx		=	PWM_Tim->PWM_BasicData.TIMx;
	
	u32	TIMx_Frequency	=	0	;			//定时器频率
	u16 TIMx_Prescaler	=	0	;			//定时器时钟分频值		取值范围：0x0000~0xFFFF
  u16 TIMx_Period			=	0	;			//定时器自动重装载值	取值范围：0x0000~0xFFFF
	
	PWM_Frequency				=	2*(PWM_Frequency);	//由于翻转需要双倍频率
	//*6.2.3,获取TIMx时钟**********************************************************************
	//1）-----分频值及自动重装载值计算（PWM_Frequency 频率，单位Hz）
	//--------1MHz 1us=1000ns,1KHz 10us=10000ns
	RCC_GetClocksFreq(&RCC_ClocksStatus);	//获取时钟参数
	TIMx_Frequency = RCC_ClocksStatus.SYSCLK_Frequency;;
	if ((((u32)TIMx)&APB2PERIPH_BASE) == APB2PERIPH_BASE)
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK2_Frequency;	//APB2
  }
  else
  {
    TIMx_Frequency = RCC_ClocksStatus.PCLK1_Frequency;	//APB1
  }
	//*6.2.4,计算定时器参数*********************************************************************
	if(PWM_Frequency>100000)		//>100KHz
	{
		TIMx_Prescaler=0;
		TIMx_Period=(u16)(TIMx_Frequency/PWM_Frequency-1);
	}
	else if(PWM_Frequency>1000)	//>1KHz
	{
		TIMx_Prescaler=10-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/10-1);
	}
	else if(PWM_Frequency>100)		//>100Hz
	{
		TIMx_Prescaler=100-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/100-1);
	}
	else if(PWM_Frequency>10)		//>10Hz
	{
		TIMx_Prescaler=1000-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/1000-1);
	}
	else if(PWM_Frequency<=10)		//<=10Hz
	{
		TIMx_Prescaler=2000-1;
		TIMx_Period=(u16)((TIMx_Frequency/PWM_Frequency)/2000-1);
	}
	//6.3定时器初始化*********************************************************************
	
	/* Set the Autoreload value */
  TIMx->ARR = TIMx_Period;        		//设定自动重装载值

  /* Set the Prescaler value */
  TIMx->PSC = TIMx_Prescaler; 				//设定分频值
	
//	TIMx->CNT	=	1;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void PWM_OUT_SetCount(PWM_TimDef* PWM_Tim,u32 PWM_Count)			//设置输出个数
{
	if(PWM_Count	!=	0)
	{
		PWM_Tim->PWM_BasicData.PWM_Count	=	2*PWM_Count;
		PWM_Tim->PWM_RunData.PWM_Pulse		=	0;
		PWM_Tim->PWM_RunData.PWM_Cycle		=	0;	
		
		
		PWM_Tim->PWM_BasicData.GPIOx->BRR = PWM_Tim->PWM_BasicData.GPIO_Pin_n;			//GPIO_ResetBits(GPIO_TypeDef* GPIOx, u16 GPIO_Pin);						//输出低
		TIM1->CNT	=	1;
		TIM_Cmd(PWM_Tim->PWM_BasicData.TIMx, ENABLE); 															//使能TIM		//输出高
	}
	else
	{
		PWM_Tim->PWM_BasicData.PWM_Count	=	0;
		PWM_Tim->PWM_RunData.PWM_Pulse		=	0;
		PWM_Tim->PWM_RunData.PWM_Cycle		=	0;
		
		PWM_Tim->PWM_BasicData.GPIOx->BRR = PWM_Tim->PWM_BasicData.GPIO_Pin_n;			//GPIO_ResetBits(GPIO_TypeDef* GPIOx, u16 GPIO_Pin);						//输出低
		TIM_Cmd(PWM_Tim->PWM_BasicData.TIMx, DISABLE); 															//禁止TIM
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
u8 PWM_OUT_TIMServer(PWM_TimDef* PWM_Tim)			//PWM输出配置
{
	volatile u8	temp	=	0;
	if((PWM_Tim->PWM_BasicData.TIMx->SR & TIM_IT_Update)	== TIM_IT_Update)
	{
		if(PWM_Tim->PWM_RunData.PWM_Pulse<PWM_Tim->PWM_BasicData.PWM_Count)
		{
			if(PWM_Tim->PWM_RunData.PWM_Pulse	<	PWM_Tim->PWM_BasicData.PWM_RunUp)		//加速
			{
				if(PWM_Tim->PWM_RunData.PWM_Cycle++	>=	PWM_Tim->PWM_BasicData.PWM_Updata)
				{
					PWM_Tim->PWM_RunData.PWM_Cycle	=	0;
					PWM_Tim->PWM_BasicData.PWM_Frequency+=20;						//频率增加--加速
					PWM_OUT_SetFre(PWM_Tim,PWM_Tim->PWM_BasicData.PWM_Frequency);														//设置时间
				}
			}
			else if(PWM_Tim->PWM_RunData.PWM_Pulse+(PWM_Tim->PWM_BasicData.PWM_RunUp)>PWM_Tim->PWM_BasicData.PWM_Count)
			{
				if(PWM_Tim->PWM_RunData.PWM_Cycle++>=PWM_Tim->PWM_BasicData.PWM_Updata	&&	PWM_Tim->PWM_BasicData.PWM_Frequency>200)
				{
					PWM_Tim->PWM_RunData.PWM_Cycle	=	0;
					PWM_Tim->PWM_BasicData.PWM_Frequency-=20;						//频率增加--加速
					PWM_OUT_SetFre(PWM_Tim,PWM_Tim->PWM_BasicData.PWM_Frequency);														//设置时间
				}
			}
		
			PWM_Tim->PWM_RunData.PWM_Pulse++;
			
			API_GPIO_Toggle	(PWM_Tim->PWM_BasicData.GPIOx,	PWM_Tim->PWM_BasicData.GPIO_Pin_n);		//将GPIO相应管脚输出翻转----V20170605
			
//			TIM_ClearFlag(PWM_Tim->PWM_BasicData.TIMx, TIM_FLAG_Update);									//清除中断标志
			return 1;
			
		}
		else
		{
			PWM_Tim->PWM_RunData.PWM_Pulse	=	0;
			PWM_Tim->PWM_BasicData.GPIOx->BRR = PWM_Tim->PWM_BasicData.GPIO_Pin_n;			//GPIO_ResetBits(GPIO_TypeDef* GPIOx, u16 GPIO_Pin);
			TIM_ClearFlag(PWM_Tim->PWM_BasicData.TIMx, TIM_FLAG_Update);									//清除中断标志
			TIM_Cmd(PWM_Tim->PWM_BasicData.TIMx, DISABLE); 															//禁止TIM
			return 2;				//计数完成
			
		}
		TIM_ClearFlag(PWM_Tim->PWM_BasicData.TIMx, TIM_FLAG_Update);									//清除中断标志
		return 1;
	}
	return 0;
}












//======================================================PWM输出配置20190810






